{
  "Name": "Pieces for Developers 22 Biggest Achievements of 2022",
  "Slug": "pieces-for-developers-22-biggest-achievements-of-2022",
  "Collection ID": "639a29236d30b28900f0ea0c",
  "Item ID": "63c848cb51e449027e5a241b",
  "Created On": "Wed Jan 18 2023 19:30:18 GMT+0000 (Coordinated Universal Time)",
  "Updated On": "Mon Mar 27 2023 17:30:46 GMT+0000 (Coordinated Universal Time)",
  "Published": "Mon Mar 27 2023 17:30:46 GMT+0000 (Coordinated Universal Time)",
  "Update Summary": "45 product releases. 106 blog posts. Thousands of snippets saved. Tens of thousands of product installs. 2022 was a big year here at Pieces!",
  "HeaderImage": "https://uploads-ssl.webflow.com/6143afec68f555387049efb3/63c8481e774cec1bf2c61c7d_2022recap_fd903a7e067814d691c33d49aa8f71df_2000.jpeg",
  "MainBody": "<p>45 product releases. 106 blog posts. Thousands of snippets saved. Tens of thousands of product installs. It’s an understatement to say that 2022 was a big year here at Pieces! To celebrate our wins and make sure you didn’t miss anything, we’ve compiled our 22 Biggest Achievements of 2022.</p><p>Without further ado, the best of the year:</p><h2 id=\"59kqj\">1. 37,000+ Pieces for Developers Suite Installs</h2><p>We hit some mega milestones this year 👀 Our <a href=\"https://plugins.jetbrains.com/plugin/17328-pieces--save-search-share--reuse-code-snippets/\" target=\"_blank\" rel=\"noopener noreferrer\">JetBrains</a> plugin reached 10,000+ installs, our <a href=\"https://marketplace.visualstudio.com/items?itemName=MeshIntelligentTechnologiesInc.pieces-vscode\" target=\"_blank\" rel=\"noopener noreferrer\">VS Code</a> extension reached 11,000+ installs, our <a href=\"https://chrome.google.com/webstore/detail/pieces-save-code-snippets/igbgibhbfonhmjlechmeefimncpekepm?hl=en\" target=\"_blank\" rel=\"noopener noreferrer\">Web Extension</a> reached 2,000+ installs, and the <a href=\"https://code.pieces.app/install\" target=\"_blank\" rel=\"noopener noreferrer\">Pieces Desktop App</a> reached more than 15,000 installs— and we’re just getting started. We’re beyond thankful for our early adopters and we can’t wait to add thousands more developers to our user base in 2023.</p><h2 id=\"133ph\">2. 15 Pieces Desktop App Releases</h2><p>Yep, that’s more than one every month. Our engineering team has absolutely crushed it this year (more on that below). From Snippet Discovery to Workflow Activity, we’ve shipped dozens of features, bug fixes, UI updates, and performance improvements to create a drastically improved Pieces experience from this time last year. Read up on any releases you missed <a href=\"https://code.pieces.app/updates?5d28a74b_page=0\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h2 id=\"2rvns\">3. 13 Pieces for VS Code Releases</h2><p>In the past 12 months, <a href=\"https://marketplace.visualstudio.com/items?itemName=MeshIntelligentTechnologiesInc.pieces-vscode\" target=\"_blank\" rel=\"noopener noreferrer\">Pieces for VS Code</a> has evolved from a fairly basic add-on to a robust, incredibly useful IDE extension. Our team has worked hard to allow VS Code users to save, reuse, and manage their snippets directly from their editor, which makes it much easier to utilize your code snippets without big changes to your workflow.</p><h2 id=\"esvpd\">4. 10 Pieces for JetBrains Releases</h2><p>Just like Pieces for VS Code, Pieces for JetBrains has grown into one of the most innovative plugins on the marketplace. We’ve upped performance, refined UI, and integrated auto-magical features to do everything from auto-save highly reusable snippets to installing the plugin without restarting your JetBrains IDE. If you haven’t already, check out the plugin <a href=\"https://plugins.jetbrains.com/plugin/17328-pieces--save-search-share--reuse-code-snippets/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h2 id=\"71og4\">5. 6 Pieces Web Extension Releases</h2><p>The Pieces Web Extension is a little different from our IDE extensions— it really streamlines the saving process when you’re hunting for code solutions around the web. This year we transformed our web extension from a single-button “Save this code” extension to a truly useful, fully customizable tool that helps you save snippets without digging back through your search results. Save the code you need in less than a second (yes, really!) <a href=\"https://chrome.google.com/webstore/detail/pieces-save-code-snippets/igbgibhbfonhmjlechmeefimncpekepm?hl=en\" target=\"_blank\" rel=\"noopener noreferrer\">right now</a>.</p><h2 id=\"eqgrs\">6. 120 Published Blog Articles</h2><p>Our ultimate goal is to be helpful to fellow developers. As part of that goal, this year, we launched our <a href=\"https://code.pieces.app/content-partner\" target=\"_blank\" rel=\"noopener noreferrer\">Content Partner Program</a> and published 120+ technical articles that are deeply helpful to the entire dev community. Check out our <a href=\"https://code.pieces.app/blog\" target=\"_blank\" rel=\"noopener noreferrer\">blog</a> to learn about anything from <a href=\"https://code.pieces.app/blog/how-to-write-test-and-deploy-ethereum-smart-contracts-using-truffle\" target=\"_blank\" rel=\"noopener noreferrer\">writing smart contracts</a> to <a href=\"https://code.pieces.app/blog/dart-on-cli-foundations\" target=\"_blank\" rel=\"noopener noreferrer\">building Dart CLIs</a>.</p><h2 id=\"arru4\">7. 10 Published YouTube Videos</h2><p>Did you know that we have a <a href=\"https://www.youtube.com/@getpieces/featured\" target=\"_blank\" rel=\"noopener noreferrer\">YouTube channel</a>? We launched it this year so that we can create and share video tutorials about the Pieces for Developers Suite. Our first 10 videos are live— subscribe so you don’t miss any tutorials, power tips, or workflow hacks in 2023!</p><h2 id=\"5g680\">8. 3 Team Meetups</h2><p>From Poland to San Francisco, our team is spread across seven countries. While we connect virtually almost every day, it’s always more fun to gather in person! This year, we gathered (nearly) the entire team three times, twice in Cincinnati and once in Lisbon, Portugal. All three meetups were productive, innovative, and a whole lot of fun.</p><h2 id=\"3db30\">9. Auto-generated metadata</h2><p>Our Machine Learning and Infrastructure teams do an incredible job of developing models that automatically generate tags, descriptions, snippet classifications, related links, related people, and more. This year, all of those models were integrated into our products, released to our users, <em>and</em> updated to be faster and more precise. Check out all of that sweet, sweet metadata in the Information View of the Pieces Desktop app— everything we’ve auto-generated is marked with ✨.</p><h2 id=\"fincp\">10. Snippet Discovery in the Pieces Desktop App</h2><p>This is one of our favorites. Snippet Discovery not only extracts useful snippets from a given file or directory, it automatically enriches them and makes them instantly reusable across the Pieces suite. Snippet Discovery helps you standardize your code, share standardized snippets among your team, and saves time rewriting the same code over and over. Learn more about this game-changing feature <a href=\"https://code.pieces.app/updates/pieces-1-9-0-write-less-code-save-more-time-with-snippet-discovery\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h2 id=\"2gi8a\">11. Auto-complete in the Pieces IDE Plugins</h2><p>In the first half of the year, we launched the first-ever auto-complete feature that is exclusively trained on snippets from your personal repository. In JetBrains and VS Code, Pieces suggests your snippets precisely when they’re most useful so that you don’t have to search for the right code. Read more about the release <a href=\"https://code.pieces.app/updates/pieces-for-vs-code-0-1-4-code-auto-complete-is-live\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h2 id=\"5fvak\">12. Snippet Sharing via Pieces Links</h2><p>The first of many cloud-enabled features, we released snippet sharing this summer, with big updates to the feature throughout the summer and fall. Pieces links allow you to easily share a code snippet and its context with your team, your friends, or within articles and public repositories. Try it out by hitting [CTRL/CMD + L] in the desktop app or by right-clicking a snippet in the IDE plugins.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img alt=\"Generating a Pieces shareable link.\" src=\"https://uploads-ssl.webflow.com/6143afec68f555387049efb3/63c1a51eee03b61664a8292b_shareable-link_def783ee88a89bdc150d0eccc5971d18.gif\" /></div></figure><h2 id=\"bkkgc\">13. Auto-saved Git Context in the IDE Plugins</h2><p>Every developer uses Git. As of this fall, any snippet you create in our IDE plugins automatically includes extra-helpful context from your Git history, like code authors, commit messages, files, projects and more— in addition to all of the other context Pieces captures. Read more about it in the <a href=\"https://code.pieces.app/updates/pieces-for-vs-code-0117-gitmore-context\" target=\"_blank\" rel=\"noopener noreferrer\">release notes</a>.</p><h2 id=\"eru5r\">14. Workflow Activity in the Pieces Desktop App</h2><p>Our latest release includes an early preview of Workflow Activity view, a chronological timeline of when you create, delete, share, and manage context for your snippets. We’re working hard on the next version of this view to make it even more useful for your workflow! Keep an eye out for exciting changes in 2023.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img alt=\"Scrolling through Workflow Activity in the Pieces desktop app.\" src=\"https://uploads-ssl.webflow.com/6143afec68f555387049efb3/63bc4925a5cf1e29e4a3161c_ActivityViewOpenRelatedLinkViewSavedPiece_201758073ac366f4f8dbcd2afd3b4ad1.gif\" /></div></figure><h2 id=\"92jfv\">15. Snippet Discovery in the Web Extension</h2><p>We know how vital the <a href=\"https://chrome.google.com/webstore/detail/pieces-save-code-snippets/igbgibhbfonhmjlechmeefimncpekepm?hl=en\" target=\"_blank\" rel=\"noopener noreferrer\">Web Extension</a> is to save snippets quickly from around the web and capture helpful context to find snippets easier later on. Earlier this month, we released Snippet Discovery in the Web Extension, which remembers the last 100 snippets you’ve come across while browsing and allows you to save them with one click from the popover menu. No more retracing your steps!</p><h2 id=\"9qt53\">16. Linux Compatibility across the entire Pieces for Developers Suite</h2><p>We’ve been working on this one all year— the Pieces Suite is now compatible with Linux operating systems. We’re thrilled to support developers on every operating system! If you’re interested in trying the Beta version of our Linux-compatible Pieces OS and Pieces Desktop app, download it <a href=\"https://code.pieces.app/install\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p><h2 id=\"6702r\">17. Snippet Editing across the entire Pieces for Developers Suite</h2><p>Saving code is already awesome, but easily editing what you’ve saved so that it’s exactly what you want? That’s even better. In April, we shipped <a href=\"https://code.pieces.app/updates/snippet-editing-is-live\" target=\"_blank\" rel=\"noopener noreferrer\">snippet editing</a> in the Pieces Desktop App, quickly followed by snippet editing in our IDE plugins in May. With a super simple keyboard shortcut or right-click, you can customize your code and save it for easy re-use later.</p><h2 id=\"8s52u\">18. Manage snippets from our IDE plugins</h2><p>Do you remember December 2021? Way back then, in order to manage your snippets and their metadata, you had to do it in the Pieces desktop app. These days, you can do all of that from your IDE by leveraging our VS Code and JetBrains plugins— all you need is Pieces OS.</p><h2 id=\"2ems8\">19. APILayer Partnership &amp; the Launch of TLP APIs</h2><p>In March, we launched a partnership with APILayer to bring developers all over the world access to our suite of Technical Language Processing (TLP) APIs. The first API we launched was our Code Detection API, which has implications for messaging apps, word and code processing apps, and hundreds of other apps. Read more about the launch in <a href=\"https://apilayer.com/press/apilayer-and-pieces-launch-api-partnership\" target=\"_blank\" rel=\"noopener noreferrer\">this press release</a>!</p><h2 id=\"5ihp4\">20. StartupCincy Week</h2><p>In mid-October, hundreds of Cincinnati’s brightest startup founders, investors, and early employees gathered to build community and spark innovation at <a href=\"https://startupcincy.com/startupcincyweek/\" target=\"_blank\" rel=\"noopener noreferrer\">StartupCincy Week</a>. Mack, one of our co-founders, offered wisdom to aspiring founders at the Welcome Breakfast, we chatted with budding talent at the Startup Cincy Job Fair, and our entire team cheered on five of Cincinnati’s top startups at the Cincy’s Got Startups Happy Hour. We’re honored to be building a world-class company right here in Cincinnati alongside so many other talented teams.</p><h2 id=\"3sm95\">21. Named Best Tech Startup in Cincinnati</h2><p>We’re absolutely blown away to have been named the <a href=\"https://www.bizjournals.com/cincinnati/inno/stories/awards/2022/06/24/inno-fire-winners.html?taid=62b5a7427240840001f2cb00&amp;utm_campaign=trueanthem&amp;utm_medium=trueanthem&amp;utm_source=twitter\" target=\"_blank\" rel=\"noopener noreferrer\">Best Tech Startup in Cincinnati</a> by Cincinnati Inno last July. Our product is truly the first of its kind, and we’re so happy to be able to share it with more and more developers. Check out the <a href=\"https://twitter.com/getpieces/status/1540369013133512708\" target=\"_blank\" rel=\"noopener noreferrer\">full article</a> to read more about us and other cutting-edge companies in Cincy!</p><h2 id=\"9eko6\">22. Our Team</h2><p>Last, but certainly not least, we are so thankful to have a hardworking, dedicated Pieces team. From January through December, we’ve taken big chances and worked hard to find creative solutions to hard problems, all to make developers around the world more productive. If you thought this year was big… just wait until next year. 😎</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img alt=\"Photographs of our team throughout the year.\" src=\"https://uploads-ssl.webflow.com/6143afec68f555387049efb3/63cb03fd94c40692d40b128a_team_bcd4d33749545f8b6c82b58719212287_800.jpeg\" /></div></figure>\n\n    <figure data-rt-type=\"video\" data-rt-align=\"center\">\n        <!-- strchf script -->\n<script>\n        if(window.strchfSettings === undefined) window.strchfSettings = {};\n    window.strchfSettings.stats = {url: \"https://pieces-app.storychief.io/en/pieces-for-developers-22-biggest-achievements-of-2022?id=618714363&type=26\",title: \"Pieces for Developers 22 Biggest Achievements of 2022\",id: \"f48cd0d8-d254-4e17-a18e-3d20939412eb\"};\n            (function(d, s, id) {\n      var js, sjs = d.getElementsByTagName(s)[0];\n      if (d.getElementById(id)) {window.strchf.update(); return;}\n      js = d.createElement(s); js.id = id;\n      js.src = \"https://d37oebn0w9ir6a.cloudfront.net/scripts/v0/strchf.js\";\n      js.async = true;\n      sjs.parentNode.insertBefore(js, sjs);\n    }(document, 'script', 'storychief-jssdk'))\n    </script>\n<!-- End strchf script -->    </figure>",
  "Date": "Wed Jan 18 2023 18:00:00 GMT+0000 (Coordinated Universal Time)",
  "Tags": "new-features; recap"
}
